Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: a third conductive pin (31) and a fourth conductive pin (32) are disposed on a second surface that is of the field effect transistor (30) and that faces the capacitor (10);
de_de: ein dritter leitfähiger Stift (31) und ein vierter leitfähiger Stift (32) auf einer zweiten Oberfläche des Feldeffekttransistors (30) angeordnet sind, die dem Kondensator (10) zugewandt ist;

source: a power supply pin (21) and a ground pin (22) are respectively disposed on two opposite surfaces of the laser transmitter (20);
de_de: ein Stromversorgungsstift (21) und ein Erdungsstift (22) jeweils auf zwei gegenüberliegenden Oberflächen des Lasertransmitters (20) angeordnet sind;

source: the power supply pin (21) and the first conductive pin (11) are disposed opposite to each other and conductively connected;
de_de: der Stromversorgungsstift (21) und der erste leitfähige Stift (11) einander gegenüberliegend angeordnet und leitfähig verbunden sind;

source: the ground pin (22) and the third conductive pin (31) are disposed opposite to each other and conductively connected; and
de_de: der Erdungsstift (22) und der dritte leitfähige Stift (31) einander gegenüberliegend angeordnet und leitfähig verbunden sind; und

source: the second conductive pin (12) and the fourth conductive pin (32) are disposed opposite to each other and conductively connected.
de_de: der zweite leitfähige Stift (12) und der vierte leitfähige Stift (32) einander gegenüberliegend angeordnet und leitfähig verbunden sind.

source: 3. The laser transmitter module according to claim 2, wherein the power supply pin (21) and the first conductive pin (11) are bonded and connected by using a conductive adhesive; and
de_de: 3. Laserübertragungsmodul nach Anspruch 2, wobei der Stromversorgungsstift (21) und der erste leitfähige Stift (11) mithilfe eines leitfähigen Klebstoffs haften und verbunden sind; und

source: the ground pin (22) and the third conductive pin (31) are bonded and connected by using a conductive adhesive.
de_de: der Erdungsstift (22) und der dritte leitfähige Stift (31) mithilfe eines leitfähigen Klebstoffs haften und verbunden sind.

source: 4. The laser transmitter module according to claim 2 or 3, wherein the second conductive pin (12) and the fourth conductive pin (32) are conductively connected through a conductive column (40), and the conductive column (40) and the laser transmitter (20) are disposed on a same layer.
de_de: 4. Laserübertragungsmodul nach Anspruch 2 oder 3, wobei der zweite leitfähige Stift (12) und der vierte leitfähige Stift (32) durch eine leitfähige Säule (40) leitfähig verbunden sind und die leitfähige Säule (40) und der Lasertransmitter (20) auf derselben Schicht angeordnet sind.

source: 5. The laser transmit module (1) according to claim 4, wherein the conductive column (40) is separately bonded and connected to the second conductive pin (12) and the fourth conductive pin (32) by using a conductive adhesive.
de_de: 5. Laserübertragungsmodul (1) nach Anspruch 4, wobei die leitfähige Säule (40) separat an dem zweiten leitfähigen Stift (12) und dem vierten leitfähigen Stift (32) mithilfe eines leitfähigen Klebstoffs haftet und damit verbunden ist.

source: 6. The laser transmit module (1) according to claim 4, wherein the conductive column (40) is a conductive adhesive layer, and the conductive adhesive layer is separately bonded and connected to the second conductive pin (12) and the fourth conductive pin (32).
de_de: 6. Laserübertragungsmodul (1) nach Anspruch 4, wobei die leitfähige Säule (40) eine leitfähige Klebstoffschicht ist und die leitfähige Klebstoffschicht separat an dem zweiten leitfähigen Stift (12) und dem vierten leitfähigen Stift (32) haftet und damit verbunden ist.

source: 7. The laser transmit module (1) according to any one of claims 2 to 6, wherein the field effect transistor (30) further comprises a control pin (33), and the control pin (33) is located on a third surface (35) of the field effect transistor (30).
de_de: 7. Laserübertragungsmodul (1) nach einem der Ansprüche 2 bis 6, wobei der Feldeffekttransistor (30) ferner einen Steuerstift (33) umfasst und sich der Steuerstift (33) auf einer dritten Oberfläche (35) des Feldeffekttransistors (30) befindet.

source: 8. The laser transmit module (1) according to claim 7, wherein the third surface (35) and the second surface (34) are two opposite surfaces or two adjacent surfaces.
de_de: 8. Laserübertragungsmodul (1) nach Anspruch 7, wobei die dritte Oberfläche (35) und die zweite Oberfläche (34) zwei gegenüberliegende Oberflächen oder zwei benachbarte Oberflächen sind.

source: 9. The laser transmit module (1) according to any one of claims 2 to 8, wherein the capacitor (10) comprises a fifth conductive pin (13) and a sixth conductive pin (14);
de_de: 9. Laserübertragungsmodul (1) nach einem der Ansprüche 2 bis 8, wobei der Kondensator (10) einen fünften leitfähigen Stift (13) und einen sechsten leitfähigen Stift (14) umfasst;

source: the fifth conductive pin (13) and the first conductive pin (11) are separately conductively connected to one electrode plate of the capacitor (10);
de_de: der fünfte leitfähige Stift (13) und der erste leitfähige Stift (11) separat leitfähig mit einer Elektrodenplatte des Kondensators (10) verbunden sind;

source: the sixth conductive pin (14) and the second conductive pin (12) are separately conductively connected to another electrode plate of the capacitor (10); and
de_de: der sechste leitfähige Stift (14) und der zweite leitfähige Stift (12) separat leitfähig mit einer anderen Elektrodenplatte des Kondensators (10) verbunden sind; und

source: the fifth conductive pin (13) is configured to be connected to a power supply of a circuit board (80), and the sixth conductive pin (14) is configured to be conductively connected to a ground layer of the circuit board (80).
de_de: der fünfte leitfähige Stift (13) konfiguriert ist, um mit einer Stromversorgung einer Leiterplatte (80) verbunden zu sein, und der sechste leitfähige Stift (14) konfiguriert ist, um leitfähig mit einer Erdungsschicht der Leiterplatte (80) verbunden zu sein.

source: The laser transmit module (1) according to claim 9, wherein both the fifth conductive pin (13) and the sixth conductive pin (14) face the circuit board (80).
de_de: Laserübertragungsmodul (1) nach Anspruch 9, wobei sowohl der fünfte leitfähige Stift (13) als auch der sechste leitfähige Stift (14) der Leiterplatte (80) zugewandt sind.

source: A laser radar, comprising the laser transmit module (1) according to any one of claims 1 to 10, a scanning apparatus, and a detector, wherein the scanning apparatus is configured to reflect a detection laser pulse transmitted by the laser transmit module into a scanning laser light and is configured to reflect, to the detector, a reflected laser pulse obtained when the scanning laser light reflected back by a detected object; and
de_de: Laserradar, umfassend das Laserübertragungsmodul (1) nach einem der Ansprüche 1 bis 10, eine Abtastvorrichtung und einen Detektor, wobei die Abtastvorrichtung konfiguriert ist, um einen von dem Laserübertragungsmodul übertragenen Detektionslaserimpuls in ein Abtastlaserlicht zu reflektieren und einen reflektierten Laserimpuls, der erlangt wird, wenn das Abtastlaserlicht von einem detektierten Objekt zurückreflektiert wird, zu dem Detektor zurückzureflektieren; und

source: the detector is configured to perform laser detection based on the reflected laser pulse.
de_de: der Detektor konfiguriert ist, um eine Laserdetektion basierend auf dem reflektierten Laserimpuls durchzuführen.

source: 1. A dual output directly modulated laser device (100, 200, 300, 400, 500, 600) for generating two distinct optical output signals, comprising:
de_de: 1. Direkt modulierte Laservorrichtung (100, 200, 300, 400, 500, 600) mit zwei Ausgängen zum Erzeugen zweier unterschiedlicher optischer Ausgangssignale, umfassend:

source: two outer gain sections, each directly modulated by injection of a respective modulation current; and
de_de: zwei äußere Verstärkungsabschnitte, die jeweils direkt durch Injektion eines entsprechenden Modulationsstroms moduliert werden; und

source: a central section (110, 210, 310, 410, 510, 610) comprising a distributed reflector;
de_de: einen mittleren Abschnitt (110, 210, 310, 410, 510, 610), der einen verteilten Reflektor umfasst;

source: a first output laser facet (112A, 212A, 312A, 412A, 512A, 612A) and a second output laser facet (112B, 212B, 312B, 412B, 512B, 612B);
de_de: eine erste Ausgangslaserfacette (112A, 212A, 312A, 412A, 512A, 612A) und eine zweite Ausgangslaserfacette (112B, 212B, 312B, 412B, 512B, 612B);

source: characterized in that
de_de: dadurch gekennzeichnet, dass

source: the distributed reflector is configured to provide optical feedback to both outer gain sections while preventing the generation of stimulated photons; and in that
de_de: der verteilte Reflektor konfiguriert ist, um optische Rückkopplung an beide äußeren Verstärkungsabschnitte bereitzustellen und gleichzeitig die Erzeugung stimulierter Photonen zu verhindern; und dadurch, dass

source: the two outer gain sections form two laser cavities each configured to emit a directly modulated signal as an optical output signal in a direction away from the central section (110, 210, 310, 410, 510, 610);
de_de: die beiden äußeren Verstärkungsabschnitte zwei Laserkavitäten bilden, die jeweils konfiguriert sind, um ein direkt moduliertes Signal als optisches Ausgangssignal in eine Richtung weg von dem mittleren Abschnitt (110, 210, 310, 410, 510, 610) zu emittieren;

source: wherein a first laser cavity of the two laser cavities is formed between the central section and the first output laser facet;
de_de: wobei eine erste Laserkavität der zwei Laserkavitäten zwischen dem mittleren Abschnitt und der ersten Ausgangslaserfacette gebildet ist;

source: wherein a second laser cavity of the two laser cavities is formed between the central section and the second output laser facet.
de_de: wobei eine zweite Laserkavität der zwei Laserkavitäten zwischen dem mittleren Abschnitt und der zweiten Ausgangslaserfacette gebildet ist.

source: 2. The laser device (100, 200, 300, 400, 500, 600) of claim 1, wherein a length of the central section (110, 210, 310, 410, 510, 610) is selected such that transmission between the outer gain sections is less than a predefined level.
de_de: 2. Laservorrichtung (100, 200, 300, 400, 500, 600) nach Anspruch 1, wobei eine Länge des mittleren Abschnitts (110, 210, 310, 410, 510, 610) derart gewählt ist, dass die Transmission zwischen den äußeren Verstärkungsabschnitten geringer als ein vordefinierter Pegel ist.

source: 3. The laser device (100, 200, 300, 400, 500, 600) of claim 1 or claim 2, wherein a length of a first outer gain section (108A, 208A, 308A, 408A, 508A, 608A) is longer than a length of a second outer gain section (108B, 208B, 308B, 408B, 508B, 608B), such that a power output of a corresponding first laser output facet (112A, 312A, 412A, 512A, 612A) is greater than a power output of a second laser output facet (112B, 312B, 412B, 512B, 612B).
de_de: 3. Laservorrichtung (100, 200, 300, 400, 500, 600) nach Anspruch 1 oder Anspruch 2, wobei eine Länge eines ersten äußeren Verstärkungsabschnitts (108A, 208A, 308A, 408A, 508A, 608A) derart länger ist als eine Länge eines zweiten äußeren Verstärkungsabschnitts (108B, 208B, 308B, 408B, 508B, 608B), dass eine Leistungsabgabe einer entsprechenden ersten Laserausgangsfacette (112A, 312A, 412A, 512A, 612A) größer ist als eine Leistungsabgabe einer zweiten Laserausgangsfacette (112B, 312B, 412B, 512B, 612B).

source: 4. The laser device (100, 200, 300, 400, 500, 600) of any preceding claim, wherein a data rate of a first modulation current is different to a data rate of a second modulation current.
de_de: 4. Laservorrichtung (100, 200, 300, 400, 500, 600) nach einem der vorhergehenden Ansprüche, wobei sich eine Datenrate eines ersten Modulationsstroms von einer Datenrate eines zweiten Modulationsstroms unterscheidet.

source: 5. The laser device (100, 200, 300, 400, 500, 600) of any preceding claim, wherein the central section (110, 210, 310, 410, 510, 610) comprises an active region material layer (106, 206, 306, 406) biased such that an optical gain of the central section (110, 210, 310, 410, 510, 610) is substantially the same or less than an aggregated optical loss associated with the central section (110, 210, 310, 410, 510, 610).
de_de: 5. Laservorrichtung (100, 200, 300, 400, 500, 600) nach einem der vorhergehenden Ansprüche, wobei der mittlere Abschnitt (110, 210, 310, 410, 510, 610) eine Materialschicht (106, 206, 306, 406) des aktiven Bereichs umfasst, die derart vorgespannt ist, dass eine optische Verstärkung des mittleren Abschnitts (110, 210, 310, 410, 510, 610) im Wesentlichen gleich oder kleiner als ein aggregierter optischer Verlust ist, der dem mittleren Abschnitt (110, 210, 310, 410, 510, 610) zugeordnet ist.

source: 6. The laser device (100, 200, 300, 400, 500, 600) of claim 5, wherein the two outer gain sections share a common active region material layer (106, 206, 306, 406) with the central section (110, 210, 310, 410, 510, 610).
de_de: 6. Laservorrichtung (100, 200, 300, 400, 500, 600) nach Anspruch 5, wobei die beiden äußeren Verstärkungsabschnitte eine gemeinsame Materialschicht (106, 206, 306, 406) des aktiven Bereichs mit dem mittleren Abschnitt (110, 210, 310, 410, 510, 610) teilen.

source: 7. The laser device (100, 200, 300, 400, 500, 600) of claim 5, wherein an active region material layer (106, 206, 306, 406) of the laser device (100, 200, 300, 400, 500, 600) is formed of two halves, each half configured to emit a different wavelength band.
de_de: 7. Laservorrichtung (100, 200, 300, 400, 500, 600) nach Anspruch 5, wobei eine Materialschicht (106, 206, 306, 406) des aktiven Bereichs des Lasergeräts (100, 200, 300, 400, 500, 600) aus zwei Hälften besteht, von denen jede Hälfte konfiguriert ist, um ein anderes Wellenlängenband zu emittieren.

source: 8. The laser device (100, 200, 300, 400, 500, 600) of any one of claims 1 to 4, where the central section (110, 210, 310, 410, 510, 610) comprises a waveguide (606B) formed from a passive material.
de_de: 8. Laservorrichtung (100, 200, 300, 400, 500, 600) nach einem der Ansprüche 1 bis 4, wobei der zentrale Abschnitt (110, 210, 310, 410, 510, 610) einen Wellenleiter (606B) umfasst, der aus einem passiven Material gebildet ist.

source: 9. The laser device (100, 200, 300, 400, 500, 600) of any preceding claim, wherein the reflector is a high-refractive index distributed Bragg reflector.
de_de: 9. Laservorrichtung (100, 200, 300, 400, 500, 600) nach einem der vorhergehenden Ansprüche, wobei der Reflektor ein verteilter Bragg-Reflektor mit hohem Brechungsindex ist.

source: The laser device (100, 200, 300, 400, 500, 600) of any preceding claim, wherein the laser device (100, 200, 300, 400, 500, 600) is divided into three independent sections by etching isolation trenches between adjacent electrical contacts for each of the section.
de_de: Lasergerät (100, 200, 300, 400, 500, 600) nach einem der vorhergehenden Ansprüche, wobei das Lasergerät (100, 200, 300, 400, 500, 600) durch Ätzen von Isolationsgräben zwischen benachbarten elektrischen Kontakten für jeden der Abschnitte in drei unabhängige Abschnitte unterteilt ist.

source: The laser device (100, 200, 300, 400, 500, 600) of any preceding claim, wherein each of the cavities is configured as a Fabry-Perot-type cavity.
de_de: Laservorrichtung (100, 200, 300, 400, 500, 600) nach einem der vorhergehenden Ansprüche, wobei jede der Kavitäten als eine Kavität vom Fabry-Perot-Typ konfiguriert ist.

source: The laser device (100, 200, 300, 400, 500, 600) of any one of claims 1 to 10, wherein each of the cavities comprises a grating to select a predefined wavelength for the cavity.
de_de: Laservorrichtung (100, 200, 300, 400, 500, 600) nach einem der Ansprüche 1 bis 10, wobei jede der Kavitäten ein Gitter umfasst, um eine vordefinierte Wellenlänge für die Kavität auszuwählen.

source: The laser device (100, 200, 300, 400, 500, 600) of claim 12, wherein a different wavelength is selected for each cavity.
de_de: Laservorrichtung (100, 200, 300, 400, 500, 600) nach Anspruch 12, wobei für jede Kavität eine unterschiedliche Wellenlänge ausgewählt ist.

source: An optical network unit, ONU, configured to receive data from a downstream main passive optical network, PON, and comprising the laser device (100, 200, 300, 400, 500, 600) of any preceding claim,
de_de: Optische Netzwerkeinheit, ONU, die konfiguiert ist, um Daten von einem nachgeschalteten passiven optischen Hauptnetzwerk (PON) zu empfangen, und die die Laservorrichtung (100, 200, 300, 400, 500, 600) nach einem der vorhergehenden Ansprüche umfasst,

source: wherein a first outer gain section (108A, 208A, 308A, 408A, 508A, 608A) of the laser device (100, 200, 300, 400, 500, 600) is configured to transmit a first directly modulated optical output signal (118A, 218A, 318A, 418A, 518A, 618A) to the upstream main-PON, and
de_de: wobei ein erster äußerer Verstärkungsabschnitt (108A, 208A, 308A, 408A, 508A, 608A) der Laservorrichtung (100, 200, 300, 400, 500, 600) konfiguriert ist, um ein erstes direkt moduliertes optisches Ausgangssignal (118A, 218A, 318A, 418A, 518A, 618A) an das vorgeschaltete Haupt-PON zu übertragen, und

source: wherein a second outer gain section (108B, 208B, 308B, 408B, 508B, 608B) of the laser device (100, 200, 300, 400, 500, 600) is configured to transmit a second directly modulated optical output signal (118B, 218B, 318B, 418B, 518B, 618B) to a downstream sub-PON.
de_de: wobei ein zweiter äußerer Verstärkungsabschnitt (108B, 208B, 308B, 408B, 508B, 608B) der Laservorrichtung (100, 200, 300, 400, 500, 600) konfiguriert ist, um ein zweites direkt moduliertes optisches Ausgangssignal (118B, 218B, 318B, 418B, 518B, 618B) an ein nachgeschaltetes Sub-PON zu übertragen.

source: A passive optical network (1900), PON, comprising:
de_de: Passives optisches Netzwerk (1900), PON, umfassend:

source: a main-PON configured to transmit and receive data to and from a plurality of ONUs (1904) of claim 14, and
de_de: ein Haupt-PON, das konfiguriert ist, um Daten an eine Vielzahl von ONUs (1904) nach Anspruch 14 zu übertragen und davon zu empfangen, und

source: a plurality of sub-PONs (1908) corresponding receive and transmit data from and to the plurality of ONUs (1904).
de_de: eine entsprechende Vielzahl von Sub-PONs (1908), die Daten von der Vielzahl von ONUs (1904) empfängt und dahin überträgt.

source: 1. An apparatus (100) for personalized binaural audio rendering of an input signal, wherein the apparatus (100) comprises:
de_de: 1. Vorrichtung (100) zur personalisierten binauralen Audiowiedergabe eines Eingangssignals, wobei die Vorrichtung (100) umfasst:

source: a left ear transducer (101a) configured to generate a left ear audio signal and a right ear transducer (101b) configured to generate a right ear audio signal; and
de_de: einen Wandler (101a) für das linke Ohr, der konfiguriert ist, um ein Audiosignal für das linke Ohr zu erzeugen, und einen Wandler (101b) für das rechte Ohr, der konfiguriert ist, um ein Audiosignal für das rechte Ohr zu erzeugen; und

source: a processing circuitry (103) configured to determine based on a current target direction (301a) of the input signal an adjusted current target direction (301b) using a personalized adjustment function (103a), wherein the personalized adjustment function (103a) describes a functional relationship between a plurality of reference target directions of a reference sound signal and a plurality of perceived reference target directions of the reference sound signal as perceived by a user (110);
de_de: eine Verarbeitungsschaltung (103), die konfiguriert ist, um basierend auf einer aktuellen Zielrichtung (301a) des Eingangssignals eine angepasste aktuelle Zielrichtung (301b) mithilfe einer personalisierten Anpassungsfunktion (103a) zu bestimmen, wobei die personalisierte Anpassungsfunktion (103a) eine funktionale Beziehung zwischen einer Vielzahl von Referenzzielrichtungen eines Referenztonsignals und einer Vielzahl von wahrgenommenen Referenzzielrichtungen des Referenztonsignals, wie von einem Benutzer (110) wahrgenommen, beschreibt;
